package ir.dunijet.teamgit.util

import androidx.compose.ui.graphics.ImageBitmap
import ir.dunijet.teamgit.data.model.Blog
import ir.dunijet.teamgit.data.model.Filtering

const val SITE_BASE_URL = "https://team-git.iran.liara.run/"
const val KEY_BLOG = "keyBlogScreen"
const val CACHE_TIME = 120      // minute
val NO_FILTER = Filtering(emptyList() , emptyList())

//val listArticle = listOf(
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//    Blog(
//        1,
//        "این هوش مصنوعی خیلی عشقه و همه دوست دارند که بتونن توی کاراشون ازش استفاده کنن واقعا منم همینطور هستم",
//        "چت جی پی تی (ChatGPT) جدیدترین «مدل زبانی» (Language Model) مبتنی بر هوش مصنوعی ارائه شده توسط مجموعه OpenAI به حساب می\u200Cآید. این مطلب، راهنمایی جامع برای نحوه استفاده از دستیار مجازی Chat GPT است. در این نوشته ابتدا به این پرسش پاسخ می\u200Cدهیم که ChatGPT چیست و سپس پیرامون چگونگی دسترسی و نحوه استفاده از چت جی پی تی در ایران، چگونگی شروع به کار با آن، کاربردهای اصلی و مهم ChatGPT و فواید آن خواهید آموخت. شما با مطالعه این مطلب یاد خواهید گرفت که چطور از ChatGPT به نفع خود و برای پیشرفت در حوزه فعالیت خود استفاده کنید و از مزایای آن بهره\u200Cمند شوید. همچنین مثال\u200Cهایی را برای استفاده از چت\u200Cجی\u200Cپی\u200Cتی به زبان فارسی هم ارائه داده\u200Cایم.",
//        "",
//        "هوش مصنوعی",
//        listOf("تکنولوژی", "هوش مصنوعی")
//    ),
//
//)

val mockArticle = Blog(
    "-1" ,
    "" ,
    "" ,
    "" ,
    "" ,
    "" ,
    "" ,
    "" ,
    0
)